dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxLmu_reg.h
/** \brief 70, LMU Region Lower Address Register */
#define LMU0_RGN2_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100070u)
/** Alias (User Manual Name) for LMU0_RGN2_LA.
* To use register names with standard convension, please use LMU0_RGN2_LA.
*/
#define LMU0_RGNLA2 (LMU0_RGN2_LA)

/** \brief 74, LMU Region Upper Address Register */
#define LMU0_RGN2_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100074u)
/** Alias (User Manual Name) for LMU0_RGN2_UA.
* To use register names with standard convension, please use LMU0_RGN2_UA.
*/
#define LMU0_RGNUA2 (LMU0_RGN2_UA)

/** \brief 78, LMU Region Write Access Enable Register A */
#define LMU0_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100078u)
/** Alias (User Manual Name) for LMU0_RGN2_ACCENA.
* To use register names with standard convension, please use LMU0_RGN2_ACCENA.
*/
#define LMU0_RGNACCENWA2 (LMU0_RGN2_ACCENA)

/** \brief 7C, LMU Region Write Access Enable Register B */
#define LMU0_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810007Cu)
/** Alias (User Manual Name) for LMU0_RGN2_ACCENB.
* To use register names with standard convension, please use LMU0_RGN2_ACCENB.
*/
#define LMU0_RGNACCENWB2 (LMU0_RGN2_ACCENB)

/** \brief 80, LMU Region Lower Address Register */
#define LMU0_RGN3_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100080u)
/** Alias (User Manual Name) for LMU0_RGN3_LA.
* To use register names with standard convension, please use LMU0_RGN3_LA.
*/
#define LMU0_RGNLA3 (LMU0_RGN3_LA)

/** \brief 84, LMU Region Upper Address Register */
#define LMU0_RGN3_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100084u)
/** Alias (User Manual Name) for LMU0_RGN3_UA.
* To use register names with standard convension, please use LMU0_RGN3_UA.
*/
#define LMU0_RGNUA3 (LMU0_RGN3_UA)

/** \brief 88, LMU Region Write Access Enable Register A */
#define LMU0_RGN3_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100088u)
/** Alias (User Manual Name) for LMU0_RGN3_ACCENA.
* To use register names with standard convension, please use LMU0_RGN3_ACCENA.
*/
#define LMU0_RGNACCENWA3 (LMU0_RGN3_ACCENA)

/** \brief 8C, LMU Region Write Access Enable Register B */
#define LMU0_RGN3_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810008Cu)
/** Alias (User Manual Name) for LMU0_RGN3_ACCENB.
* To use register names with standard convension, please use LMU0_RGN3_ACCENB.
*/
#define LMU0_RGNACCENWB3 (LMU0_RGN3_ACCENB)

/** \brief 90, LMU Region Lower Address Register */
#define LMU0_RGN4_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100090u)
/** Alias (User Manual Name) for LMU0_RGN4_LA.
* To use register names with standard convension, please use LMU0_RGN4_LA.
*/
#define LMU0_RGNLA4 (LMU0_RGN4_LA)

/** \brief 94, LMU Region Upper Address Register */
#define LMU0_RGN4_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100094u)
/** Alias (User Manual Name) for LMU0_RGN4_UA.
* To use register names with standard convension, please use LMU0_RGN4_UA.
*/
#define LMU0_RGNUA4 (LMU0_RGN4_UA)

/** \brief 98, LMU Region Write Access Enable Register A */
#define LMU0_RGN4_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100098u)
/** Alias (User Manual Name) for LMU0_RGN4_ACCENA.
* To use register names with standard convension, please use LMU0_RGN4_ACCENA.
*/
#define LMU0_RGNACCENWA4 (LMU0_RGN4_ACCENA)

/** \brief 9C, LMU Region Write Access Enable Register B */
#define LMU0_RGN4_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810009Cu)
/** Alias (User Manual Name) for LMU0_RGN4_ACCENB.
* To use register names with standard convension, please use LMU0_RGN4_ACCENB.
*/
#define LMU0_RGNACCENWB4 (LMU0_RGN4_ACCENB)

/** \brief A0, LMU Region Lower Address Register */
#define LMU0_RGN5_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000A0u)
/** Alias (User Manual Name) for LMU0_RGN5_LA.
* To use register names with standard convension, please use LMU0_RGN5_LA.
*/
#define LMU0_RGNLA5 (LMU0_RGN5_LA)

/** \brief A4, LMU Region Upper Address Register */
#define LMU0_RGN5_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000A4u)
/** Alias (User Manual Name) for LMU0_RGN5_UA.
* To use register names with standard convension, please use LMU0_RGN5_UA.
*/
#define LMU0_RGNUA5 (LMU0_RGN5_UA)

/** \brief A8, LMU Region Write Access Enable Register A */
#define LMU0_RGN5_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81000A8u)
/** Alias (User Manual Name) for LMU0_RGN5_ACCENA.
* To use register names with standard convension, please use LMU0_RGN5_ACCENA.
*/
#define LMU0_RGNACCENWA5 (LMU0_RGN5_ACCENA)

/** \brief AC, LMU Region Write Access Enable Register B */
#define LMU0_RGN5_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81000ACu)
/** Alias (User Manual Name) for LMU0_RGN5_ACCENB.
* To use register names with standard convension, please use LMU0_RGN5_ACCENB.
*/
#define LMU0_RGNACCENWB5 (LMU0_RGN5_ACCENB)

/** \brief B0, LMU Region Lower Address Register */
#define LMU0_RGN6_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000B0u)
/** Alias (User Manual Name) for LMU0_RGN6_LA.
* To use register names with standard convension, please use LMU0_RGN6_LA.
*/
#define LMU0_RGNLA6 (LMU0_RGN6_LA)

/** \brief B4, LMU Region Upper Address Register */
#define LMU0_RGN6_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000B4u)
/** Alias (User Manual Name) for LMU0_RGN6_UA.
* To use register names with standard convension, please use LMU0_RGN6_UA.
*/
#define LMU0_RGNUA6 (LMU0_RGN6_UA)

/** \brief B8, LMU Region Write Access Enable Register A */
#define LMU0_RGN6_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81000B8u)
/** Alias (User Manual Name) for LMU0_RGN6_ACCENA.
* To use register names with standard convension, please use LMU0_RGN6_ACCENA.
*/
#define LMU0_RGNACCENWA6 (LMU0_RGN6_ACCENA)

/** \brief BC, LMU Region Write Access Enable Register B */
#define LMU0_RGN6_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81000BCu)
/** Alias (User Manual Name) for LMU0_RGN6_ACCENB.
* To use register names with standard convension, please use LMU0_RGN6_ACCENB.
*/
#define LMU0_RGNACCENWB6 (LMU0_RGN6_ACCENB)

/** \brief C0, LMU Region Lower Address Register */
#define LMU0_RGN7_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000C0u)
/** Alias (User Manual Name) for LMU0_RGN7_LA.
* To use register names with standard convension, please use LMU0_RGN7_LA.
*/
#define LMU0_RGNLA7 (LMU0_RGN7_LA)

/** \brief C4, LMU Region Upper Address Register */
#define LMU0_RGN7_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000C4u)
/** Alias (User Manual Name) for LMU0_RGN7_UA.
* To use register names with standard convension, please use LMU0_RGN7_UA.
*/
#define LMU0_RGNUA7 (LMU0_RGN7_UA)

/** \brief C8, LMU Region Write Access Enable Register A */
#define LMU0_RGN7_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81000C8u)
/** Alias (User Manual Name) for LMU0_RGN7_ACCENA.
* To use register names with standard convension, please use LMU0_RGN7_ACCENA.
*/
#define LMU0_RGNACCENWA7 (LMU0_RGN7_ACCENA)

/** \brief CC, LMU Region Write Access Enable Register B */
#define LMU0_RGN7_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81000CCu)
/** Alias (User Manual Name) for LMU0_RGN7_ACCENB.
* To use register names with standard convension, please use LMU0_RGN7_ACCENB.
*/
#define LMU0_RGNACCENWB7 (LMU0_RGN7_ACCENB)

/** \brief D0, LMU Region Lower Address Register */
#define LMU0_RGN8_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000D0u)
/** Alias (User Manual Name) for LMU0_RGN8_LA.
* To use register names with standard convension, please use LMU0_RGN8_LA.
*/
#define LMU0_RGNLA8 (LMU0_RGN8_LA)

/** \brief D4, LMU Region Upper Address Register */
#define LMU0_RGN8_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000D4u)
/** Alias (User Manual Name) for LMU0_RGN8_UA.
* To use register names with standard convension, please use LMU0_RGN8_UA.
*/
#define LMU0_RGNUA8 (LMU0_RGN8_UA)

/** \brief D8, LMU Region Write Access Enable Register A */
#define LMU0_RGN8_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81000D8u)
/** Alias (User Manual Name) for LMU0_RGN8_ACCENA.
* To use register names with standard convension, please use LMU0_RGN8_ACCENA.
*/
#define LMU0_RGNACCENWA8 (LMU0_RGN8_ACCENA)

/** \brief DC, LMU Region Write Access Enable Register B */
#define LMU0_RGN8_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81000DCu)
/** Alias (User Manual Name) for LMU0_RGN8_ACCENB.
* To use register names with standard convension, please use LMU0_RGN8_ACCENB.
*/
#define LMU0_RGNACCENWB8 (LMU0_RGN8_ACCENB)

/** \brief E0, LMU Region Lower Address Register */
#define LMU0_RGN9_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000E0u)
/** Alias (User Manual Name) for LMU0_RGN9_LA.
* To use register names with standard convension, please use LMU0_RGN9_LA.
*/
#define LMU0_RGNLA9 (LMU0_RGN9_LA)

/** \brief E4, LMU Region Upper Address Register */
#define LMU0_RGN9_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000E4u)
/** Alias (User Manual Name) for LMU0_RGN9_UA.
* To use register names with standard convension, please use LMU0_RGN9_UA.
*/
#define LMU0_RGNUA9 (LMU0_RGN9_UA)

/** \brief E8, LMU Region Write Access Enable Register A */
#define LMU0_RGN9_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81000E8u)
/** Alias (User Manual Name) for LMU0_RGN9_ACCENA.
* To use register names with standard convension, please use LMU0_RGN9_ACCENA.
*/
#define LMU0_RGNACCENWA9 (LMU0_RGN9_ACCENA)

/** \brief EC, LMU Region Write Access Enable Register B */
#define LMU0_RGN9_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81000ECu)
/** Alias (User Manual Name) for LMU0_RGN9_ACCENB.
* To use register names with standard convension, please use LMU0_RGN9_ACCENB.
*/
#define LMU0_RGNACCENWB9 (LMU0_RGN9_ACCENB)

/** \brief F0, LMU Region Lower Address Register */
#define LMU0_RGN10_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000F0u)
/** Alias (User Manual Name) for LMU0_RGN10_LA.
* To use register names with standard convension, please use LMU0_RGN10_LA.
*/
#define LMU0_RGNLA10 (LMU0_RGN10_LA)

/** \brief F4, LMU Region Upper Address Register */
#define LMU0_RGN10_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000F4u)
/** Alias (User Manual Name) for LMU0_RGN10_UA.
* To use register names with standard convension, please use LMU0_RGN10_UA.
*/
#define LMU0_RGNUA10 (LMU0_RGN10_UA)

/** \brief F8, LMU Region Write Access Enable Register A */
#define LMU0_RGN10_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81000F8u)
/** Alias (User Manual Name) for LMU0_RGN10_ACCENA.
* To use register names with standard convension, please use LMU0_RGN10_ACCENA.
*/
#define LMU0_RGNACCENWA10 (LMU0_RGN10_ACCENA)

/** \brief FC, LMU Region Write Access Enable Register B */
#define LMU0_RGN10_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81000FCu)
/** Alias (User Manual Name) for LMU0_RGN10_ACCENB.
* To use register names with standard convension, please use LMU0_RGN10_ACCENB.
*/
#define LMU0_RGNACCENWB10 (LMU0_RGN10_ACCENB)

