dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxLmu_reg.h
/** \brief 70, LMU Region Lower Address Register */
#define LMU1_RGN2_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110070u)
/** Alias (User Manual Name) for LMU1_RGN2_LA.
* To use register names with standard convension, please use LMU1_RGN2_LA.
*/
#define LMU1_RGNLA2 (LMU1_RGN2_LA)

/** \brief 74, LMU Region Upper Address Register */
#define LMU1_RGN2_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110074u)
/** Alias (User Manual Name) for LMU1_RGN2_UA.
* To use register names with standard convension, please use LMU1_RGN2_UA.
*/
#define LMU1_RGNUA2 (LMU1_RGN2_UA)

/** \brief 78, LMU Region Write Access Enable Register A */
#define LMU1_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8110078u)
/** Alias (User Manual Name) for LMU1_RGN2_ACCENA.
* To use register names with standard convension, please use LMU1_RGN2_ACCENA.
*/
#define LMU1_RGNACCENWA2 (LMU1_RGN2_ACCENA)

/** \brief 7C, LMU Region Write Access Enable Register B */
#define LMU1_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF811007Cu)
/** Alias (User Manual Name) for LMU1_RGN2_ACCENB.
* To use register names with standard convension, please use LMU1_RGN2_ACCENB.
*/
#define LMU1_RGNACCENWB2 (LMU1_RGN2_ACCENB)

/** \brief 80, LMU Region Lower Address Register */
#define LMU1_RGN3_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110080u)
/** Alias (User Manual Name) for LMU1_RGN3_LA.
* To use register names with standard convension, please use LMU1_RGN3_LA.
*/
#define LMU1_RGNLA3 (LMU1_RGN3_LA)

/** \brief 84, LMU Region Upper Address Register */
#define LMU1_RGN3_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110084u)
/** Alias (User Manual Name) for LMU1_RGN3_UA.
* To use register names with standard convension, please use LMU1_RGN3_UA.
*/
#define LMU1_RGNUA3 (LMU1_RGN3_UA)

/** \brief 88, LMU Region Write Access Enable Register A */
#define LMU1_RGN3_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8110088u)
/** Alias (User Manual Name) for LMU1_RGN3_ACCENA.
* To use register names with standard convension, please use LMU1_RGN3_ACCENA.
*/
#define LMU1_RGNACCENWA3 (LMU1_RGN3_ACCENA)

/** \brief 8C, LMU Region Write Access Enable Register B */
#define LMU1_RGN3_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF811008Cu)
/** Alias (User Manual Name) for LMU1_RGN3_ACCENB.
* To use register names with standard convension, please use LMU1_RGN3_ACCENB.
*/
#define LMU1_RGNACCENWB3 (LMU1_RGN3_ACCENB)

/** \brief 90, LMU Region Lower Address Register */
#define LMU1_RGN4_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110090u)
/** Alias (User Manual Name) for LMU1_RGN4_LA.
* To use register names with standard convension, please use LMU1_RGN4_LA.
*/
#define LMU1_RGNLA4 (LMU1_RGN4_LA)

/** \brief 94, LMU Region Upper Address Register */
#define LMU1_RGN4_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110094u)
/** Alias (User Manual Name) for LMU1_RGN4_UA.
* To use register names with standard convension, please use LMU1_RGN4_UA.
*/
#define LMU1_RGNUA4 (LMU1_RGN4_UA)

/** \brief 98, LMU Region Write Access Enable Register A */
#define LMU1_RGN4_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8110098u)
/** Alias (User Manual Name) for LMU1_RGN4_ACCENA.
* To use register names with standard convension, please use LMU1_RGN4_ACCENA.
*/
#define LMU1_RGNACCENWA4 (LMU1_RGN4_ACCENA)

/** \brief 9C, LMU Region Write Access Enable Register B */
#define LMU1_RGN4_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF811009Cu)
/** Alias (User Manual Name) for LMU1_RGN4_ACCENB.
* To use register names with standard convension, please use LMU1_RGN4_ACCENB.
*/
#define LMU1_RGNACCENWB4 (LMU1_RGN4_ACCENB)

/** \brief A0, LMU Region Lower Address Register */
#define LMU1_RGN5_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100A0u)
/** Alias (User Manual Name) for LMU1_RGN5_LA.
* To use register names with standard convension, please use LMU1_RGN5_LA.
*/
#define LMU1_RGNLA5 (LMU1_RGN5_LA)

/** \brief A4, LMU Region Upper Address Register */
#define LMU1_RGN5_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100A4u)
/** Alias (User Manual Name) for LMU1_RGN5_UA.
* To use register names with standard convension, please use LMU1_RGN5_UA.
*/
#define LMU1_RGNUA5 (LMU1_RGN5_UA)

/** \brief A8, LMU Region Write Access Enable Register A */
#define LMU1_RGN5_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81100A8u)
/** Alias (User Manual Name) for LMU1_RGN5_ACCENA.
* To use register names with standard convension, please use LMU1_RGN5_ACCENA.
*/
#define LMU1_RGNACCENWA5 (LMU1_RGN5_ACCENA)

/** \brief AC, LMU Region Write Access Enable Register B */
#define LMU1_RGN5_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81100ACu)
/** Alias (User Manual Name) for LMU1_RGN5_ACCENB.
* To use register names with standard convension, please use LMU1_RGN5_ACCENB.
*/
#define LMU1_RGNACCENWB5 (LMU1_RGN5_ACCENB)

/** \brief B0, LMU Region Lower Address Register */
#define LMU1_RGN6_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100B0u)
/** Alias (User Manual Name) for LMU1_RGN6_LA.
* To use register names with standard convension, please use LMU1_RGN6_LA.
*/
#define LMU1_RGNLA6 (LMU1_RGN6_LA)

/** \brief B4, LMU Region Upper Address Register */
#define LMU1_RGN6_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100B4u)
/** Alias (User Manual Name) for LMU1_RGN6_UA.
* To use register names with standard convension, please use LMU1_RGN6_UA.
*/
#define LMU1_RGNUA6 (LMU1_RGN6_UA)

/** \brief B8, LMU Region Write Access Enable Register A */
#define LMU1_RGN6_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81100B8u)
/** Alias (User Manual Name) for LMU1_RGN6_ACCENA.
* To use register names with standard convension, please use LMU1_RGN6_ACCENA.
*/
#define LMU1_RGNACCENWA6 (LMU1_RGN6_ACCENA)

/** \brief BC, LMU Region Write Access Enable Register B */
#define LMU1_RGN6_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81100BCu)
/** Alias (User Manual Name) for LMU1_RGN6_ACCENB.
* To use register names with standard convension, please use LMU1_RGN6_ACCENB.
*/
#define LMU1_RGNACCENWB6 (LMU1_RGN6_ACCENB)

/** \brief C0, LMU Region Lower Address Register */
#define LMU1_RGN7_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100C0u)
/** Alias (User Manual Name) for LMU1_RGN7_LA.
* To use register names with standard convension, please use LMU1_RGN7_LA.
*/
#define LMU1_RGNLA7 (LMU1_RGN7_LA)

/** \brief C4, LMU Region Upper Address Register */
#define LMU1_RGN7_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100C4u)
/** Alias (User Manual Name) for LMU1_RGN7_UA.
* To use register names with standard convension, please use LMU1_RGN7_UA.
*/
#define LMU1_RGNUA7 (LMU1_RGN7_UA)

/** \brief C8, LMU Region Write Access Enable Register A */
#define LMU1_RGN7_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81100C8u)
/** Alias (User Manual Name) for LMU1_RGN7_ACCENA.
* To use register names with standard convension, please use LMU1_RGN7_ACCENA.
*/
#define LMU1_RGNACCENWA7 (LMU1_RGN7_ACCENA)

/** \brief CC, LMU Region Write Access Enable Register B */
#define LMU1_RGN7_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81100CCu)
/** Alias (User Manual Name) for LMU1_RGN7_ACCENB.
* To use register names with standard convension, please use LMU1_RGN7_ACCENB.
*/
#define LMU1_RGNACCENWB7 (LMU1_RGN7_ACCENB)

/** \brief D0, LMU Region Lower Address Register */
#define LMU1_RGN8_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100D0u)
/** Alias (User Manual Name) for LMU1_RGN8_LA.
* To use register names with standard convension, please use LMU1_RGN8_LA.
*/
#define LMU1_RGNLA8 (LMU1_RGN8_LA)

/** \brief D4, LMU Region Upper Address Register */
#define LMU1_RGN8_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100D4u)
/** Alias (User Manual Name) for LMU1_RGN8_UA.
* To use register names with standard convension, please use LMU1_RGN8_UA.
*/
#define LMU1_RGNUA8 (LMU1_RGN8_UA)

/** \brief D8, LMU Region Write Access Enable Register A */
#define LMU1_RGN8_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81100D8u)
/** Alias (User Manual Name) for LMU1_RGN8_ACCENA.
* To use register names with standard convension, please use LMU1_RGN8_ACCENA.
*/
#define LMU1_RGNACCENWA8 (LMU1_RGN8_ACCENA)

/** \brief DC, LMU Region Write Access Enable Register B */
#define LMU1_RGN8_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81100DCu)
/** Alias (User Manual Name) for LMU1_RGN8_ACCENB.
* To use register names with standard convension, please use LMU1_RGN8_ACCENB.
*/
#define LMU1_RGNACCENWB8 (LMU1_RGN8_ACCENB)

/** \brief E0, LMU Region Lower Address Register */
#define LMU1_RGN9_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100E0u)
/** Alias (User Manual Name) for LMU1_RGN9_LA.
* To use register names with standard convension, please use LMU1_RGN9_LA.
*/
#define LMU1_RGNLA9 (LMU1_RGN9_LA)

/** \brief E4, LMU Region Upper Address Register */
#define LMU1_RGN9_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100E4u)
/** Alias (User Manual Name) for LMU1_RGN9_UA.
* To use register names with standard convension, please use LMU1_RGN9_UA.
*/
#define LMU1_RGNUA9 (LMU1_RGN9_UA)

/** \brief E8, LMU Region Write Access Enable Register A */
#define LMU1_RGN9_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81100E8u)
/** Alias (User Manual Name) for LMU1_RGN9_ACCENA.
* To use register names with standard convension, please use LMU1_RGN9_ACCENA.
*/
#define LMU1_RGNACCENWA9 (LMU1_RGN9_ACCENA)

/** \brief EC, LMU Region Write Access Enable Register B */
#define LMU1_RGN9_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81100ECu)
/** Alias (User Manual Name) for LMU1_RGN9_ACCENB.
* To use register names with standard convension, please use LMU1_RGN9_ACCENB.
*/
#define LMU1_RGNACCENWB9 (LMU1_RGN9_ACCENB)

/** \brief F0, LMU Region Lower Address Register */
#define LMU1_RGN10_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100F0u)
/** Alias (User Manual Name) for LMU1_RGN10_LA.
* To use register names with standard convension, please use LMU1_RGN10_LA.
*/
#define LMU1_RGNLA10 (LMU1_RGN10_LA)

/** \brief F4, LMU Region Upper Address Register */
#define LMU1_RGN10_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100F4u)
/** Alias (User Manual Name) for LMU1_RGN10_UA.
* To use register names with standard convension, please use LMU1_RGN10_UA.
*/
#define LMU1_RGNUA10 (LMU1_RGN10_UA)

/** \brief F8, LMU Region Write Access Enable Register A */
#define LMU1_RGN10_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF81100F8u)
/** Alias (User Manual Name) for LMU1_RGN10_ACCENA.
* To use register names with standard convension, please use LMU1_RGN10_ACCENA.
*/
#define LMU1_RGNACCENWA10 (LMU1_RGN10_ACCENA)

/** \brief FC, LMU Region Write Access Enable Register B */
#define LMU1_RGN10_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF81100FCu)
/** Alias (User Manual Name) for LMU1_RGN10_ACCENB.
* To use register names with standard convension, please use LMU1_RGN10_ACCENB.
*/
#define LMU1_RGNACCENWB10 (LMU1_RGN10_ACCENB)

