dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxLmu_reg.h
/** \brief 1DC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN8_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101DCu)
/** Alias (User Manual Name) for LMU1_RGNACCEN8_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN8_RB.
*/
#define LMU1_RGNACCENRB8 (LMU1_RGNACCEN8_RB)

/** \brief 1E8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN9_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101E8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN9_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN9_RA.
*/
#define LMU1_RGNACCENRA9 (LMU1_RGNACCEN9_RA)

/** \brief 1EC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN9_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101ECu)
/** Alias (User Manual Name) for LMU1_RGNACCEN9_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN9_RB.
*/
#define LMU1_RGNACCENRB9 (LMU1_RGNACCEN9_RB)

/** \brief 1F8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN10_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101F8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN10_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN10_RA.
*/
#define LMU1_RGNACCENRA10 (LMU1_RGNACCEN10_RA)

/** \brief 1FC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN10_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101FCu)
/** Alias (User Manual Name) for LMU1_RGNACCEN10_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN10_RB.
*/
#define LMU1_RGNACCENRB10 (LMU1_RGNACCEN10_RB)

/** \brief 208, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN11_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110208u)
/** Alias (User Manual Name) for LMU1_RGNACCEN11_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN11_RA.
*/
#define LMU1_RGNACCENRA11 (LMU1_RGNACCEN11_RA)

/** \brief 20C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN11_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811020Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN11_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN11_RB.
*/
#define LMU1_RGNACCENRB11 (LMU1_RGNACCEN11_RB)

/** \brief 218, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN12_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110218u)
/** Alias (User Manual Name) for LMU1_RGNACCEN12_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN12_RA.
*/
#define LMU1_RGNACCENRA12 (LMU1_RGNACCEN12_RA)

/** \brief 21C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN12_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811021Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN12_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN12_RB.
*/
#define LMU1_RGNACCENRB12 (LMU1_RGNACCEN12_RB)

/** \brief 228, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN13_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110228u)
/** Alias (User Manual Name) for LMU1_RGNACCEN13_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN13_RA.
*/
#define LMU1_RGNACCENRA13 (LMU1_RGNACCEN13_RA)

/** \brief 22C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN13_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811022Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN13_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN13_RB.
*/
#define LMU1_RGNACCENRB13 (LMU1_RGNACCEN13_RB)

/** \brief 238, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN14_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110238u)
/** Alias (User Manual Name) for LMU1_RGNACCEN14_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN14_RA.
*/
#define LMU1_RGNACCENRA14 (LMU1_RGNACCEN14_RA)

/** \brief 23C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN14_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811023Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN14_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN14_RB.
*/
#define LMU1_RGNACCENRB14 (LMU1_RGNACCEN14_RB)

/** \brief 248, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN15_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110248u)
/** Alias (User Manual Name) for LMU1_RGNACCEN15_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN15_RA.
*/
#define LMU1_RGNACCENRA15 (LMU1_RGNACCEN15_RA)

/** \brief 24C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN15_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811024Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN15_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN15_RB.
*/
#define LMU1_RGNACCENRB15 (LMU1_RGNACCEN15_RB)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXLMU_REG_H */
